temafey/ArduinoWindStation/esp32_wind_station/esp32_wind_station.ino
// ============================================
// WIND STATION — ESP32
// ============================================
// Sensor: Polycarbonate 0-5V (speed + direction)
// Signal divider: 15kΩ top + 10kΩ bottom → 5V → 2.0V (linear ADC zone 150 mV … 2.45V)
// Battery divider: 100kΩ + 100kΩ → GPIO32
// LEDs: 5 standard through 220Ω resistors
// Power (diode-OR load sharing):
//   Adapter 5V ─► Schottky_A ─┐
//                             ├─► Rail ~4.7V ─► ESP32 VIN + Mini Boost #1 → 12V for sensor
//   Bat ─► PTC ─► TP4056 ─► Mini Boost #2 (5V) ─► Schottky_B ─┘
//   Boost #2 keeps rail at 4.7V on battery — without it AMS1117 dropout (0.8–1.25V)
//   causes ESP32 brownout on WiFi TX peaks.
//   Both boosts: Mini Boost Module (HW-085/TMF002, MT3608 IC).
// Access: join the station's own WPA2 network, then http://MyWindProbeBETA.org
//         (192.168.4.1 always works too, and .local where mDNS is supported)
// OTA: flash over that same AP via Arduino IDE → Network Port
// ============================================

#include <WiFi.h>
#include <esp_wifi.h>     // esp_wifi_ap_get_sta_list — RSSI of the connected client
#include <DNSServer.h>    // resolves the station's own name for every client
#include <WebServer.h>
#include <ESPmDNS.h>
#include <ArduinoOTA.h>
#include <lwip/sockets.h> // lwip_send — the SSE frame goes out non-blocking, see sseFlush()
#include "web_content.h"  // dashboard build (gzip, PROGMEM) — see gen_web_header.py

// Every password this firmware needs lives in secrets.h, which is NOT in git.
// A missing file stops the build on purpose: the alternative is a board that
// silently comes up on an open network, and that failure is invisible until
// someone else is already on it.
#if __has_include("secrets.h")
  #include "secrets.h"
#else
  #error "secrets.h missing - copy esp32_wind_station/secrets.example.h to secrets.h and fill it in"
#endif

// ===== ACCESS POINT =====
// The AP is the station's own network and it is unconditional: it comes up at boot
// and nothing in this firmware ever takes it down. That is the whole lesson of the
// old station mode, which kept a pool of home/hotspot networks in NVS and joined
// the strongest one at boot — the moment it associated, softAPdisconnect() shut the
// AP down ~15 s after power-up and the station vanished from the phone.
//
// An uplink is back (see HAS_HOME_NETWORK below) but on the opposite terms: AP+STA,
// where joining a network is something the board does IN ADDITION to being an
// access point, never instead of it. What has not come back is the configurable
// part — the network list in NVS, /api/wifi?add|del|connect, the 30 s rescan and
// the 3-minute fallback AP are all still gone, and the uplink is one constant in
// this file rather than a form on a page.
// The address people actually type. It resolves because the station runs its own
// DNS server for exactly this one name — no mDNS support needed on the client, so
// it works on Android too, where .local is unreliable.
//
// A real TLD, chosen deliberately for how it reads. Two consequences worth knowing,
// neither of which breaks anything here:
//   - This name is not registered to us. While a device is joined to the station it
//     asks the board for DNS, so a genuine site at this domain would be shadowed for
//     that device. The AP has no uplink anyway, so nothing else is reachable either.
//   - Browsers try HTTPS first for a real TLD and fall back to HTTP when the
//     handshake fails, which costs a moment on the first visit. Nothing to fix on
//     the board — it never listens on 443.
// Case is irrelevant (DNS is case-insensitive and the server lowercases both sides);
// it is spelled out this way only because that is how it looks in the address bar.
const char* portalHost  = "MyWindProbeBETA.org";
// mDNS label (single word, no dots) → also answers as mywindprobebeta.local, and
// this is the name ArduinoOTA advertises in the IDE's network port list.
const char* hostname    = "mywindprobebeta";
const char* otaPassword = SECRET_OTA_PASSWORD;   // secrets.h
const char* apSsid      = "WindStation";
// WPA2-PSK. The ESP32 needs 8..63 characters here; below 8 softAP() silently
// falls back to an open network, so this length is not incidental.
const char* apPassword  = SECRET_AP_PASSWORD;    // secrets.h
// Four is the driver default and more than one dashboard ever needs — a lower cap
// is one less way for a stranger to occupy a slot even without the password.
const int   apMaxClients = 4;

// ===== HOME NETWORK (optional uplink) =====
// AP+STA: the AP above stays up unconditionally and the board ALSO joins a known
// 2.4 GHz network when one is in range. This is not the station mode that was
// removed — that one called softAPdisconnect() the moment it associated, which is
// why the station used to vanish from the phone ~15 s after power-up. Nothing here
// ever touches the AP; the uplink is strictly additive and its failure costs
// nothing but the uplink itself.
//
// What it buys: the dashboard is reachable from the house without leaving the
// network that has internet, and OTA runs over the LAN instead of forcing the
// laptop onto an AP with no uplink.
//
// Set to 0 for a pure access point (mast, field, anywhere the home net is out of
// range) — the retry loop below then does not exist at all.
// Comes from secrets.h so that a checkout whose secrets.h lists no networks still
// builds — as a pure access point, which is a working station and not a broken one.
#ifdef SECRET_HAS_HOME_NETWORK
  #define HAS_HOME_NETWORK SECRET_HAS_HOME_NETWORK
#else
  #define HAS_HOME_NETWORK 0
#endif

#if HAS_HOME_NETWORK
// The networks to try, in order of preference: home first, then the places the
// station actually travels to. Tried one per attempt, round-robin — never scanned.
// A scan would cost the AP a stall of its own before a single association is even
// attempted, and the list is short enough that walking it blind is cheaper.
//
// 2.4 GHz ONLY. The ESP32 has no 5 GHz radio, so the "-5G" twin of a dual-band
// router is invisible to it no matter what is written here.
//
// The list itself is SECRET_HOME_NETWORKS in secrets.h, which git does not track.
// It still ends up in plain text inside the compiled binary — that has not changed
// and cannot, since the firmware never writes NVS. What changed is that the
// passwords are no longer in the repository or its history.
struct HomeNetwork {
  const char* ssid;
  const char* password;
};
const HomeNetwork homeNetworks[] = { SECRET_HOME_NETWORKS };
const int homeNetworkCount = sizeof(homeNetworks) / sizeof(homeNetworks[0]);
#endif

// One association attempt gets this long before the next candidate is tried. A
// successful join takes 2-5 s; the rest is margin for a router that answers slowly.
const unsigned long STA_ASSOC_MS = 12000;
// Backoff between full passes over the list — NOT between individual candidates.
// Association is not free: the driver leaves the AP's channel to do it, and every
// client on the AP stalls for the duration. Tolerable now and then, intolerable
// every 30 s forever, which is exactly what happens when none of these networks is
// there (the board on the mast). So the wait doubles after each failed pass and
// resets the moment a link comes up.
const unsigned long STA_RETRY_MIN_MS = 30000;    // after the first failed pass, 30 s
const unsigned long STA_RETRY_MAX_MS = 600000;   // ceiling, 10 min

// ===== PINS =====
#define PIN_WIND_SPEED   34   // ADC1 input-only — speed (via 15k/10k divider, Vadc 0-2.0V)
#define PIN_WIND_DIR     35   // ADC1 input-only — direction (via 15k/10k divider)
#define PIN_BATTERY      32   // ADC1 — battery (via 100k/100k divider)

// v4: LEDs moved to the ESP32 bottom pin row (breadboard cols 5-9), 220Ω resistors now on the board.
// Old top-row pins were 26/27/14/25/33. GPIO4/16/17/18 are plain GPIO; GPIO5 is a strapping pin
// (must be HIGH at boot) — an LED-to-GND via 220Ω doesn't hold it low, so it only flickers briefly
// at power-up. Harmless: assigned to WiFi LED, which is meant to be off until WiFi is up anyway.
#define PIN_LED_RED       4   // Red — wind > 15 m/s OR battery 10-30% (blink <10%) (col 5, was 14)
#define PIN_LED_YELLOW   16   // Yellow — wind > 5 m/s OR battery 30-60%            (col 6, was 27)
#define PIN_LED_GREEN    17   // Green — battery > 60% (was "station OK")           (col 7, was 26)
#define PIN_LED_WIFI      5   // Green — solid when reachable (AP client or uplink)  (col 8, was 25; strapping, boot flicker)
#define PIN_LED_ERROR    18   // Red — error (ADC/WiFi)                             (col 9, was 33)

