temafey/ArduinoWindStation/esp32_wind_station/esp32_wind_station.ino
// TP4056 status, open-drain: the IC pulls the pin to GND, so INPUT_PULLUP and LOW=active.
// GPIO13/19 chosen because neither is a strapping pin — an open-drain line held LOW at
// power-up on GPIO0/2/12/15 would change boot mode or flash voltage and brick the boot.
#define PIN_CHARGE       13   // TP4056 CHRG  — LOW while charging
#define PIN_STDBY        19   // TP4056 STDBY — LOW when charge complete (see HAS_STDBY)

// ===== CALIBRATION =====
// Signal divider: 15k top + 10k bottom → Vout = Vin × 10/(15+10) = Vin × 0.4
// Inverse: Vsensor = Vadc × (15+10)/10 = Vadc × 2.5
// Why 2.0V not 3.0V: ESP32 ADC linear zone at 11dB is 150 mV … 2.45V;
// old 10k+15k gave 3.0V and entered nonlinear zone (speeds >49 m/s were underread).
const float SIGNAL_DIVIDER_RATIO  = 2.5f;
// Battery divider 100k+100k: Vbat = Vadc × 2.0
const float BATTERY_DIVIDER_RATIO = 2.0f;

const float SENSOR_VMAX = 5.0f;    // max sensor output voltage
// NEW sensor (voltage type 0-5V, DFRobot SEN0170 clone): 0-30 m/s, speed only.
// Old sensor was 0-60 m/s — leaving 60 here doubles every reading.
const float SPEED_MAX   = 30.0f;   // m/s at 5V
const float DIR_MAX     = 360.0f;  // degrees at 5V (old sensor only, see HAS_DIRECTION)

// New sensor has no direction channel — GPIO35 hangs unconnected.
// Set to 1 only if the old speed+direction sensor is wired back.
#define HAS_DIRECTION 0

// ESP32 ADC1 @11dB cannot read below ~150 mV: with 0 V in, analogReadMilliVolts()
// bottoms out around this value. Measured on this board at 0 wind: 143-145 mV on
// both GPIO34 and GPIO35 (identical floor on both = proof it is the ADC, not signal).
// Re-measure with the sensor still (see speedMv in /api/data) and update if the
// board changes.
//
// This floor is a SATURATION, not an offset. Above it the calibrated reading tracks
// the input; below it every input collapses onto the same ~145 mV. So it is used as a
// gate — at or under it the air is calm and speed is 0 — and is NOT subtracted from
// readings above it. Subtracting it (what this code did until 2026-08-08) shifted the
// whole scale down by one full floor: at 66.7 mV per m/s that is 2.2 m/s off every
// single sample, so a true 3 m/s reported 0.8 and a true 10 reported 7.8. Symptom:
// the station looked dead unless the cups were spun hard.
// Set a few mV above the measured floor so noise at rest cannot leak a phantom value.
// CONSEQUENCE, unchanged by the fix: real speeds below ~2.3 m/s still report 0, and
// the reading jumps straight from 0 to ~2.3 when the sensor crosses the gate. There is
// no measurement down there to interpret — firmware can stop corrupting the rest of
// the range, but it cannot invent the bottom of it. Only a level shift on the divider
// or an external ADC moves that boundary. HAS_LEVEL_SHIFT below is the first of those.
const float SPEED_ZERO_MV = 150.0f;

// ===== LOW-WIND LEVEL SHIFT (optional hardware mod) =====
// The whole reason the station is deaf below ~2.3 m/s (8 km/h) is that 0 m/s sits at
// 0 mV, i.e. inside the ADC's dead zone. Lift the divider node with a third resistor
// from 3V3 and 0 m/s lands at ~0.37 V instead — 200 mV clear of the floor, so the
// bottom of the range becomes an actual measurement and the gate can go back to being
// a plain offset subtraction.
//
//   sensor ──[15k]──┬── GPIO34        R3 from 3V3 to the same node
//                [10k]                (see FIRMWARE.md for the arithmetic)
//                  GND
//
// Set to 1 ONLY after R3 is physically fitted — with no resistor on the board this
// subtracts a bias that is not there and every reading comes out ~6 m/s low.
#define HAS_LEVEL_SHIFT 0

#if HAS_LEVEL_SHIFT
// R3 = 47k. Nominal figures for 15k/10k/47k off a 3.30 V rail:
//   bias at 0 m/s   0.374 V      gain 0.3548      full scale 2.15 V at 30 m/s
//   scale           59.1 mV per m/s   (was 66.7 without the shift)
// Both constants are NOMINAL and both must be replaced with measured values: the rail
// is not exactly 3.30 V and 5% resistors move the bias by tens of mV, which is whole
// tenths of a m/s at the bottom. Measure with /api/zero, see FIRMWARE.md.
const float SPEED_BIAS_MV_DEFAULT  = 374.0f;
// Inverse of the new divider gain, 1/0.3548. Replaces SIGNAL_DIVIDER_RATIO — R3 loads
// the node in parallel with the 10k, so the sensor sees a different ratio than before.
const float SIGNAL_DIVIDER_SHIFTED = 2.819f;
// Guard band above the measured bias, in mV. Only job is to keep ADC noise at rest from
// reading as a light breeze; at 59 mV per m/s, 6 mV is 0.1 m/s of deadband.
const float SPEED_BIAS_DEADBAND_MV = 6.0f;
#endif

// The zero point actually in use. Starts at the compile-time constant and can be
// re-measured in place through /api/zero without a reflash — the value that matters
// here is a property of this board's resistors and this chip's ADC offset, so it is
// worth being able to correct it with the sensor sitting still in front of you.
// Not persisted: NVS is never written by this firmware (see the OTA notes), so a
// number found in the field has to be copied back into the constant above to survive
// a reboot. /api/zero prints it in a form that can be pasted straight in.
#if HAS_LEVEL_SHIFT
float speedZeroMv = SPEED_BIAS_MV_DEFAULT;
#else
float speedZeroMv = SPEED_ZERO_MV;
#endif

// Battery divider now taps the holder wire, not TP_B+ (TP4056 back-feeds TP_B+ from
// USB and fakes a battery). No pack wired -> node floats, R6 100k pulls it to 0.
const float BATTERY_PRESENT_MV = 500.0f;  // <0.5V on pin (=1.0V pack) means absent

const float BATTERY_MIN = 3.5f;    // 0% — below this Mini Boost #2 loses regulation (MT3608 min Vin ~2V, but margin shrinks at 3.5V), rail 4.7V sags
const float BATTERY_MAX = 4.2f;    // 100%

// Set to 1 once TP4056 STDBY is wired to PIN_STDBY. With CHRG alone "full" cannot be
// told from "running on battery": CHRG goes high-Z both when charging finishes and when
// USB is unplugged. Without STDBY we fall back to a voltage guess, which misreads a
// freshly charged pack on battery power as "full".
#define HAS_STDBY 1
#if !HAS_STDBY
const float BATTERY_FULL_V = 4.05f;  // fallback "full" threshold when HAS_STDBY is 0
#endif

// External power is derived from the two status lines rather than measured on IN+:
// the TP4056 can only pull CHRG or STDBY low while its own input is powered, so
// "either line active" == "cable plugged in". Saves a divider and an ADC pin.
// Sticky release, not a plain sample: with no pack the IC ping-pongs charge<->standby
// at ~1 Hz and both lines read inactive in the gap between the two states. Asserting
// on the first active sample but releasing only after this hold keeps the dashboard
// steady while still noticing an unplugged cable within a few seconds.
const unsigned long STATUS_HOLD_MS = 3000;

// ===== STATE =====
float windSpeed = 0;
float windDir   = 0;
float windGust  = 0;
// Averaged millivolts on the speed pin, before the calm gate. Exposed only so the
// floor can be re-measured in place: open /api/data with the sensor still and read
// speedMv — that number is what SPEED_ZERO_MV has to sit just above.
float speedMvRaw = 0;
// Spread of the 32 raw samples in one burst (max - min), in millivolts. This is the
// number that answers "is the radio getting into the analog side": with the sensor
// still it should be single-digit mV, and it stays that way whether or not a dashboard
// is streaming. Tens of mV that appear only while WiFi is transmitting mean the
// interference is real and belongs in a capacitor, not in a firmware constant.
float speedMvSpread = 0;
float batteryVoltage = 0;
int   batteryPercent = 0;
bool  batteryPresent = false;
// "absent" | "charging" | "full" | "discharging" — what the dashboard shows
const char* chargeState = "absent";
// "external" | "battery" — where the rail is fed from right now
const char* powerSource = "battery";

