temafey/ArduinoWindStation/esp32_wind_station/esp32_wind_station.ino
// Debounce state for the two open-drain status lines. `seen` guards the boot window:
// millis() starts at 0, so a bare "millis() - lastLow < HOLD" would read as recently
// active for the first 3 s after reset and report a cable that is not there.
bool chrgSeen = false,  stdbySeen = false;
unsigned long chrgLastLow = 0, stdbyLastLow = 0;
// In AP mode there is no uplink to measure, so this holds the RSSI of the client
// the station hears best — same units, same "is the link any good" question.
int   wifiRssi  = 0;
bool  adcError  = false;

unsigned long gustResetTimer = 0;

// Ring buffer for circular mean of direction
#define DIR_BUF_SIZE 5
float dirSinBuf[DIR_BUF_SIZE] = {0};
float dirCosBuf[DIR_BUF_SIZE] = {0};
int   dirBufIdx   = 0;
int   dirBufCount = 0;

// Per-LED mode instead of plain on/off: the API accepts "off"/"on"/"blink"
// (legacy true/false still parse). Blink phase is shared and flips in
// updateLEDs() every 500 ms → 1 Hz blink, so all blinking LEDs stay in sync.
enum LedMode : uint8_t { LED_MODE_OFF = 0, LED_MODE_ON = 1, LED_MODE_BLINK = 2 };
LedMode ledGreen  = LED_MODE_OFF;
LedMode ledYellow = LED_MODE_OFF;
LedMode ledRed    = LED_MODE_OFF;
LedMode ledWifi   = LED_MODE_BLINK;  // blinking until WiFi is up
bool ledAutoMode = true;
bool blinkPhase  = false;

// ===== ACCESS POINT STATE =====
bool apUp = false;   // softAP() came up; false only if the radio failed outright

#if HAS_HOME_NETWORK
// ===== UPLINK STATE =====
// Driver auto-reconnect is turned off in setup() so there is exactly one place that
// decides when to associate — otherwise the driver's own retries and the backoff
// below would both be scanning, and the AP would stall twice as often for it.
bool staUp = false;                              // last observed link state
int  staIndex = 0;                               // next candidate in homeNetworks[]
unsigned long staBackoffMs  = STA_RETRY_MIN_MS;  // wait after a full failed pass
unsigned long staNextAttempt = 0;                // millis() of the next WiFi.begin()
#endif

// Catch-all DNS: every name resolves to the station. That is deliberate and it is
// what makes the dashboard open by itself.
//
// It started as name-only resolution, precisely to avoid answering the phone's
// connectivity probe (connectivitycheck.gstatic.com, captive.apple.com,
// msftconnecttest.com) and the "sign in to network" nag that follows. That nag
// turned out to be the feature: answering the probe is how a phone learns there
// is a page worth opening, and it removes the need to type an address at all —
// which also sidesteps the real reason typing failed, namely browsers resolving
// names through their own DNS-over-HTTPS instead of the one the AP handed out.
//
// The trade-off is now accepted on purpose: the network reads as "needs sign-in",
// and any other site opened while joined lands on the dashboard. There is no
// internet through this AP anyway, so nothing else was reachable to begin with.
//
// AsyncUDP-based, so it serves requests from its own task — nothing to pump in
// loop(); DNSServer::processNextRequest() is an empty stub in this core.
DNSServer dnsServer;

// Number of clients currently associated. Cheap enough to call from updateLEDs().
int apClients() {
  return WiFi.softAPgetStationNum();
}

// The dashboard has one signal field, so this reports whichever link the dashboard
// is most likely looking through. A client associated to our AP wins: it is the
// direct link to whoever is reading the page. Only when the AP is empty does the
// uplink RSSI stand in — that is the case where the page is being served over the
// home network and WiFi.RSSI() is the link that matters.
// 0 when there is neither, which is how the UI already renders "no signal".
int readClientRssi() {
  wifi_sta_list_t stations;
  if (esp_wifi_ap_get_sta_list(&stations) == ESP_OK && stations.num > 0) {
    int best = -127;
    for (int i = 0; i < stations.num; i++) {
      if (stations.sta[i].rssi > best) best = stations.sta[i].rssi;
    }
    return best;
  }
#if HAS_HOME_NETWORK
  if (WiFi.status() == WL_CONNECTED) return WiFi.RSSI();
#endif
  return 0;
}

WebServer server(80);

// ===== SENSOR READ =====
// Sampling cadence, deliberately faster than the SSE push: every frame then carries a
// freshly averaged value instead of one up to a whole push period stale, and a gust
// peak lands inside a sample set rather than in the gap between two reads.
const unsigned long READ_INTERVAL_MS = 20;   // 50 Hz

void readSensors() {
  // 32, not 10: averaging N samples of the same instant cuts ADC noise by sqrt(N),
  // so 3.2x more samples buys 1.8x less jitter on the number. At ~80 us per
  // analogReadMilliVolts() the burst costs ~2.6 ms, ~13% of the 20 ms budget.
  const int SAMPLES = 32;
  // Interquartile mean, not a plain average. A WiFi transmit burst is ~1 ms of a few
  // hundred mA through the same rails and a strong near field over the same board, and
  // the 2.6 ms sample burst is short enough to land inside one — so the disturbance is
  // not white noise sprinkled over the set, it is a contiguous run of samples pushed
  // the same way. A mean carries that straight into the reading; discarding the lowest
  // and highest eight survives a burst that corrupts up to a quarter of the set at each
  // end. Price is the noise floor: sqrt(16) instead of sqrt(32) of averaging, ~1.4x more
  // jitter on a quiet board, which is the cheaper of the two errors by far.
  const int TRIM = 8;
  uint16_t s[SAMPLES];
  for (int i = 0; i < SAMPLES; i++) {
    s[i] = (uint16_t)analogReadMilliVolts(PIN_WIND_SPEED);
  }
  // Insertion sort: 32 elements, already-near-sorted in the common case, and it costs
  // a few microseconds against the 2.6 ms the conversions themselves take.
  for (int i = 1; i < SAMPLES; i++) {
    uint16_t v = s[i];
    int j = i - 1;
    while (j >= 0 && s[j] > v) { s[j + 1] = s[j]; j--; }
    s[j + 1] = v;
  }
  speedMvSpread = (float)(s[SAMPLES - 1] - s[0]);   // diagnostic, see the declaration
  uint32_t speedMvSum = 0;
  for (int i = TRIM; i < SAMPLES - TRIM; i++) {
    speedMvSum += s[i];
  }
  float speedMvAvg = speedMvSum / (float)(SAMPLES - 2 * TRIM);

  // Signal loss detector: pin pulled hard to GND for ~30 s.
  // NOTE: this can no longer catch a pulled signal wire — an open input reads the
  // same ~145 mV ADC floor as a sensor sitting at 0 V. Only a dead short shows up.
  // Trip count is tied to READ_INTERVAL_MS, not a bare sample count: the detector is
  // about "dead-low for ~1.5 s", and speeding the loop from 100 ms to 20 ms would
  // otherwise fire the error LED after 300 ms and make it flicker on noise.
  static const uint16_t ZERO_TRIP = 1500 / READ_INTERVAL_MS;
  static uint16_t zeroReadings = 0;
  if (speedMvAvg < 10.0f) {
    if (zeroReadings < ZERO_TRIP) zeroReadings++;
  } else {
    zeroReadings = 0;
  }
  adcError = (zeroReadings >= ZERO_TRIP);

  speedMvRaw = speedMvAvg;   // published for field calibration, see /api/zero

#if HAS_LEVEL_SHIFT
  // With R3 fitted, 0 m/s is a real voltage sitting well above the ADC floor, so the
  // zero point IS an additive offset now and subtracting it is correct — the exact
  // opposite of the no-shift case below, which is why the two must never be mixed up.
  float speedMv = (speedMvAvg <= speedZeroMv + SPEED_BIAS_DEADBAND_MV)
                    ? 0.0f : (speedMvAvg - speedZeroMv);
  float vSpeedSensor = (speedMv / 1000.0f) * SIGNAL_DIVIDER_SHIFTED;
#else
  // Gate on the ADC floor instead of subtracting it: at or below the floor there is no
  // signal to read (calm air), above it the calibrated millivolts are already the input.
  float speedMv = (speedMvAvg <= speedZeroMv) ? 0.0f : speedMvAvg;
  float vSpeedSensor = (speedMv / 1000.0f) * SIGNAL_DIVIDER_RATIO;
#endif
  windSpeed = constrain(vSpeedSensor / SENSOR_VMAX * SPEED_MAX, 0.0f, SPEED_MAX);

