temafey/ArduinoWindStation/esp32_wind_station/esp32_wind_station.ino
#if HAS_DIRECTION
  uint32_t dirMvSum = 0;
  for (int i = 0; i < SAMPLES; i++) {
    dirMvSum += analogReadMilliVolts(PIN_WIND_DIR);
  }
  float dirMvAvg   = dirMvSum / (float)SAMPLES;
  float vDirSensor = (dirMvAvg / 1000.0f) * SIGNAL_DIVIDER_RATIO;
  float dirRaw = constrain(vDirSensor / SENSOR_VMAX * DIR_MAX, 0.0f, DIR_MAX);

  // Circular mean via sin/cos to correctly handle 0°↔360° wrap
  float rad = dirRaw * DEG_TO_RAD;
  dirSinBuf[dirBufIdx] = sinf(rad);
  dirCosBuf[dirBufIdx] = cosf(rad);
  dirBufIdx = (dirBufIdx + 1) % DIR_BUF_SIZE;
  if (dirBufCount < DIR_BUF_SIZE) dirBufCount++;

  float sSum = 0, cSum = 0;
  for (int i = 0; i < dirBufCount; i++) {
    sSum += dirSinBuf[i];
    cSum += dirCosBuf[i];
  }
  float meanRad = atan2f(sSum / dirBufCount, cSum / dirBufCount);
  windDir = fmodf(meanRad * RAD_TO_DEG + 360.0f, 360.0f);
#else
  windDir = 0;   // no direction channel; API reports null, not this value
#endif

  if (windSpeed > windGust) windGust = windSpeed;
}

// ===== BATTERY READ =====
void readBattery() {
  const int SAMPLES = 10;
  uint32_t mvSum = 0;
  for (int i = 0; i < SAMPLES; i++) {
    mvSum += analogReadMilliVolts(PIN_BATTERY);
  }
  float mvAvg = mvSum / (float)SAMPLES;

  // Divider top sits on the pack's own sense wire. Pack unplugged -> the column is
  // fed only by R6 100k to GND -> a few mV -> absent. Do not report a fake voltage.
  batteryPresent = (mvAvg >= BATTERY_PRESENT_MV);
  if (!batteryPresent) {
    batteryVoltage = 0;
    batteryPercent = 0;
    return;
  }

  batteryVoltage = (mvAvg / 1000.0f) * BATTERY_DIVIDER_RATIO;

  float pct = (batteryVoltage - BATTERY_MIN) / (BATTERY_MAX - BATTERY_MIN) * 100.0f;
  batteryPercent = (int)constrain(pct, 0.0f, 100.0f);
}

// ===== CHARGER STATUS =====
// True while the line reads active, and for STATUS_HOLD_MS after it stops. Open-drain:
// LOW means the TP4056 is pulling the line, i.e. that state is on.
static bool heldLow(uint8_t pin, bool &seen, unsigned long &lastLow) {
  if (digitalRead(pin) == LOW) {
    seen = true;
    lastLow = millis();
    return true;
  }
  return seen && (millis() - lastLow < STATUS_HOLD_MS);
}

// Called every 100 ms — readBattery()'s 30 s cadence would land on a random phase of
// the ~1 Hz blink and report charge state at the flip of a coin.
void readChargeStatus() {
  // Both lines must be sampled every pass, so evaluate before combining rather than
  // letting || short-circuit the second call and stall its debounce timer.
  bool charging = heldLow(PIN_CHARGE, chrgSeen, chrgLastLow);
#if HAS_STDBY
  bool charged  = heldLow(PIN_STDBY, stdbySeen, stdbyLastLow);
#else
  bool charged  = false;
#endif

  // The IC drives these pins only when its own input is powered, so either one active
  // proves the cable is in. Both idle means the rail is coming from the pack.
  powerSource = (charging || charged) ? "external" : "battery";

  if (!batteryPresent) {
    chargeState = "absent";
  } else if (charging) {
    chargeState = "charging";
  } else if (charged) {
    chargeState = "full";
#if !HAS_STDBY
  } else if (batteryVoltage >= BATTERY_FULL_V) {
    chargeState = "full";
#endif
  } else {
    chargeState = "discharging";
  }
}

// ===== LEDs =====
static void applyLed(uint8_t pin, LedMode m) {
  bool lit = (m == LED_MODE_ON) || (m == LED_MODE_BLINK && blinkPhase);
  digitalWrite(pin, lit ? HIGH : LOW);
}

void updateLEDs() {
  bool wifiOk = apUp;  // the AP is the whole network now — nothing to lose or retry
  blinkPhase = !blinkPhase;  // called every 500 ms → 1 Hz blink

  if (ledAutoMode) {
    // Green — battery above 60%. Off when no pack is wired (nothing to report).
    ledGreen = (batteryPresent && batteryPercent > 60) ? LED_MODE_ON : LED_MODE_OFF;

    // Yellow/red combine wind and battery with OR: either condition lights the LED.
    // In practice they rarely collide — the pack only drains when mains is gone.
    bool batYellow = batteryPresent && batteryPercent >= 30 && batteryPercent <= 60;
    ledYellow = (windSpeed > 5.0f || batYellow) ? LED_MODE_ON : LED_MODE_OFF;

    if (batteryPresent && batteryPercent < 10) {
      ledRed = LED_MODE_BLINK;  // critically low pack outranks the wind indication
    } else {
      bool batRed = batteryPresent && batteryPercent >= 10 && batteryPercent < 30;
      ledRed = (windSpeed > 15.0f || batRed) ? LED_MODE_ON : LED_MODE_OFF;
    }

    // WiFi LED: solid when the station is reachable by someone, blinking when it is
    // shouting into an empty room. "Reachable" is either a client on the AP or a live
    // uplink — a board sitting on the home network with nobody's phone attached is
    // working perfectly, and it used to blink anyway, which trained the eye to ignore
    // the one LED that is supposed to mean "look at me". Blink is now the exception.
    bool reachable = apClients() > 0;
#if HAS_HOME_NETWORK
    reachable = reachable || staUp;
#endif
    ledWifi = (wifiOk && reachable) ? LED_MODE_ON : LED_MODE_BLINK;
  }

  applyLed(PIN_LED_GREEN,  ledGreen);
  applyLed(PIN_LED_YELLOW, ledYellow);
  applyLed(PIN_LED_RED,    ledRed);
  applyLed(PIN_LED_WIFI,   ledWifi);
  digitalWrite(PIN_LED_ERROR, (adcError || !wifiOk) ? HIGH : LOW);
}

const char* ledModeStr(LedMode m) {
  switch (m) {
    case LED_MODE_ON:    return "on";
    case LED_MODE_BLINK: return "blink";
    default:             return "off";
  }
}

// "on"/"true" → on, "blink" → blink, anything else ("off"/"false") → off.
// true/false kept so an older dashboard build keeps working.
LedMode parseLedMode(const String& v) {
  if (v == "blink")             return LED_MODE_BLINK;
  if (v == "on" || v == "true") return LED_MODE_ON;
  return LED_MODE_OFF;
}

// ===== HTTP API =====
void sendCors() {
  server.sendHeader("Access-Control-Allow-Origin", "*");
}

String buildDataJson() {
  String json = "{";
  // One allocation instead of a dozen reallocs per frame. At 20 Hz the old growth
  // pattern churned the heap 20x a second and fragmented it over long uptimes.
  json.reserve(448);
  // 2 decimals, not 1: 0.1 m/s quantising was coarser than the sensor's own noise
  // after 32x averaging, so the last digit of real resolution was being rounded away
  // before it ever reached the air.
  json += "\"speed\":"          + String(windSpeed, 2) + ",";
#if HAS_DIRECTION
  json += "\"direction\":"      + String(windDir, 0)   + ",";
  json += "\"dirPresent\":true,";
#else
  json += "\"direction\":null,";
  json += "\"dirPresent\":false,";
#endif
  json += "\"gust\":"           + String(windGust, 2)  + ",";
  // Diagnostic, not a measurement: raw averaged mV on the speed pin. Lets the ADC
  // floor be checked without a USB cable — the dashboard ignores this field.
  json += "\"speedMv\":"        + String(speedMvRaw, 1) + ",";
  // Two more diagnostics, also ignored by the dashboard: the zero point currently in
  // force (so /api/zero can be checked without guessing) and the spread of one sample
  // burst, which is how radio interference on the analog side shows itself.
  json += "\"speedZeroMv\":"    + String(speedZeroMv, 1) + ",";
  json += "\"speedSpreadMv\":"  + String(speedMvSpread, 0) + ",";
  // LED fields are mode strings ("off"/"on"/"blink"), not booleans — the dashboard
  // normalizes booleans from older firmware, not the other way around.
  json += "\"ledGreen\":\""     + String(ledModeStr(ledGreen))  + "\",";
  json += "\"ledYellow\":\""    + String(ledModeStr(ledYellow)) + "\",";
  json += "\"ledRed\":\""       + String(ledModeStr(ledRed))    + "\",";
  json += "\"ledWifi\":\""      + String(ledModeStr(ledWifi))   + "\",";
  json += "\"ledAuto\":"        + String(ledAutoMode ? "true" : "false") + ",";
  if (batteryPresent) {
    json += "\"battery\":"        + String(batteryVoltage, 2) + ",";
    json += "\"batteryPercent\":" + String(batteryPercent) + ",";
  } else {
    json += "\"battery\":null,";
    json += "\"batteryPercent\":null,";
  }
  json += "\"batteryPresent\":" + String(batteryPresent ? "true" : "false") + ",";
  json += "\"chargeState\":\""  + String(chargeState) + "\",";
  json += "\"powerSource\":\""  + String(powerSource) + "\",";
  json += "\"speedMax\":"       + String(SPEED_MAX, 0) + ",";
  json += "\"wifiRssi\":"       + String(wifiRssi) + ",";
  json += "\"adcError\":"       + String(adcError ? "true" : "false") + ",";
  // Uplink status. Added fields, not changed ones — a dashboard build that predates
  // them ignores what it does not know. staIp is the only way to learn the address
  // the board answers on at home without opening the router or a serial console.
  // staSsid is which network of the list actually answered, so it is read from the
  // driver rather than from homeNetworks[] — with several candidates the constant
  // would only say which one was tried last.
#if HAS_HOME_NETWORK
  json += "\"staSsid\":"        + (staUp ? "\"" + WiFi.SSID() + "\"" : String("null")) + ",";
  json += "\"staConnected\":"   + String(staUp ? "true" : "false") + ",";
  json += "\"staIp\":"          + (staUp ? "\"" + WiFi.localIP().toString() + "\"" : String("null")) + ",";
#else
  json += "\"staSsid\":null,";
  json += "\"staConnected\":false,";
  json += "\"staIp\":null,";
#endif
  // The address to show a human, not the mDNS label — this is what the dashboard
  // prints as "станция доступна по адресу".
  json += "\"hostname\":\""     + String(portalHost) + "\",";
  json += "\"uptime\":"         + String(millis() / 1000);
  json += "}";
  return json;
}

void handleData() {
  sendCors();
  server.send(200, "application/json", buildDataJson());
}

// ===== SSE STREAM =====
// WebServer serves one client at a time and always replies "Connection: close",
// so polling above 1 Hz used to exhaust lwIP's 16 TCP PCBs (60 s TIME_WAIT each).
// Instead the dashboard subscribes once to /api/stream and we push a frame every
// SSE_PUSH_MS over that single long-lived connection — zero per-sample TCP churn.
// The trick: NetworkClient's socket is a shared_ptr, so keeping a copy here holds
// the connection open after WebServer drops its own reference at end of request.
// One subscriber is enough (one dashboard); a new subscribe replaces the old one.
// 50 ms = 20 Hz. The old 250 ms was chosen against per-sample TCP churn, which the
// single long-lived connection already solved; at ~330 bytes a frame this costs
// ~6.6 kB/s of airtime, nothing on a 802.11n link, and it is what makes the gauge
// track the cups instead of stepping after them.
const unsigned long SSE_PUSH_MS = 50;
NetworkClient sseClient;

// The frame being handed to the socket, and how many of its bytes already left. A new
// frame is only built once the previous one is fully out — see sseFlush() for why the
// socket is written to directly and what happens when the client cannot keep up.
String        sseFrame;
size_t        sseSent    = 0;
unsigned long sseDropped = 0;   // frames skipped because the previous one was still going

// Hand over as much of the pending frame as the socket will take this instant, never
// more, never waiting.
//
// sseClient.print() cannot be used for this. NetworkClient::write() loops up to
// WIFI_CLIENT_MAX_WRITE_RETRY (10) times around a select() whose timeout is
// WIFI_CLIENT_SELECT_TIMEOUT_US (1 s) — so a subscriber whose receive window is full
// stalls the whole of loop() for up to ten seconds. Everything else in loop() stops
// with it, readSensors() included: the sensor is simply not sampled for that period,
// so a short spell of slow rotation lands entirely in the blind window and never
// reaches the dashboard at all, while the frames that do arrive are stale by however
// long the stall lasted.
//
// c.setTimeout(500) used to sit here and was documented as a 500 ms write timeout. It
// was neither. NetworkClient declares its own `int _timeout` that shadows Stream's and
// never overrides setTimeout(), so the value landed in the Stream member that write()
// does not read; and the send() inside write() passes MSG_DONTWAIT, which makes
// SO_SNDTIMEO irrelevant anyway. The retry loop above was always the real bound.
//
// A full buffer therefore costs a skipped frame instead of a stalled loop. That is the
// right trade for a live gauge: 50 ms later there is a newer sample, and a backlog of
// old ones has no value to the dashboard.
void sseFlush() {
  if (sseSent >= sseFrame.length()) return;
  int fd = sseClient.fd();
  if (fd < 0) return;
  int n = lwip_send(fd, sseFrame.c_str() + sseSent, sseFrame.length() - sseSent, MSG_DONTWAIT);
  if (n > 0) {
    sseSent += n;
  } else if (n < 0 && errno != EAGAIN && errno != EWOULDBLOCK) {
    sseClient.stop();   // real socket error, not just a full window
  }
}

void handleStream() {
  NetworkClient c = server.client();
  // Nagle withholds a small segment until the previous one is ACKed, so at 20 Hz it
  // would both delay a frame by up to a full RTT and coalesce neighbouring frames
  // into one segment — the client then gets two samples with one timestamp. Off.
  c.setNoDelay(true);
  // Blocking, but harmless: this is the first thing written to a brand new socket, so
  // the send buffer is empty and the headers go out without ever filling it.
  c.print(F("HTTP/1.1 200 OK\r\n"
            "Content-Type: text/event-stream\r\n"
            "Cache-Control: no-cache\r\n"
            "Access-Control-Allow-Origin: *\r\n"
            "Connection: keep-alive\r\n\r\n"));
  if (sseClient.connected()) sseClient.stop();
  sseClient = c;
  sseFrame = "data: " + buildDataJson() + "\n\n";  // first frame, drained by sseFlush()
  sseSent  = 0;
  // No server.send() on purpose — the response above is the whole reply.
}

void handleLedControl() {
  if (server.hasArg("auto")) {
    ledAutoMode = server.arg("auto") == "true";
  }
  if (!ledAutoMode) {
    if (server.hasArg("green"))  ledGreen  = parseLedMode(server.arg("green"));
    if (server.hasArg("yellow")) ledYellow = parseLedMode(server.arg("yellow"));
    if (server.hasArg("red"))    ledRed    = parseLedMode(server.arg("red"));
    if (server.hasArg("wifi"))   ledWifi   = parseLedMode(server.arg("wifi"));
  }
  sendCors();
  server.send(200, "text/plain", "OK");
}

