temafey/ArduinoWindStation/esp32_wind_station/esp32_wind_station.ino
// Zero-point calibration in place, with the cups held still.
//   GET /api/zero            — what is in force now, and what the pin reads this instant
//   GET /api/zero?set        — adopt the current reading as the zero point
//   GET /api/zero?set=374.0  — adopt an explicit value
//   GET /api/zero?reset      — back to the compile-time constant
// RAM only, deliberately: this firmware never writes NVS (an OTA image flashed over a
// wrong partition offset would take the settings with it), so the point of the endpoint
// is to FIND the number in five minutes of trying, not to store it. The reply echoes it
// as the source line to paste back into the constant, which is where it belongs anyway —
// the value is a property of the resistors, and those do not change between reboots.
void handleZero() {
  if (server.hasArg("reset")) {
#if HAS_LEVEL_SHIFT
    speedZeroMv = SPEED_BIAS_MV_DEFAULT;
#else
    speedZeroMv = SPEED_ZERO_MV;
#endif
  } else if (server.hasArg("set")) {
    String v = server.arg("set");
    // Empty value means "take what the sensor reads right now" — that is the whole
    // point of the flag form, and it is the form used with the cups held still.
    float mv = (v.length() == 0) ? speedMvRaw : v.toFloat();
    // Refuse nonsense rather than silently bricking the scale: 0 would disable the gate
    // entirely and let the ADC floor read as 2.2 m/s of permanent phantom wind, and
    // anything past ~1 V is already a good fraction of the useful range.
    if (mv > 20.0f && mv < 1000.0f) speedZeroMv = mv;
  }

  String json = "{";
  json += "\"zeroMv\":"     + String(speedZeroMv, 1) + ",";
  json += "\"speedMv\":"    + String(speedMvRaw, 1) + ",";
  json += "\"spreadMv\":"   + String(speedMvSpread, 0) + ",";
  json += "\"levelShift\":" + String(HAS_LEVEL_SHIFT ? "true" : "false") + ",";
#if HAS_LEVEL_SHIFT
  json += "\"constant\":\"const float SPEED_BIAS_MV_DEFAULT = "
          + String(speedZeroMv, 1) + "f;\"}";
#else
  json += "\"constant\":\"const float SPEED_ZERO_MV = "
          + String(speedZeroMv, 1) + "f;\"}";
#endif

  sendCors();
  server.send(200, "application/json", json);
}

void handleResetGust() {
  windGust = windSpeed;
  gustResetTimer = millis();
  sendCors();
  server.send(200, "text/plain", "OK");
}

// Read-only. add/del/connect are still gone: the uplink is a compile-time constant,
// not something to type into a form, so there remains nothing here to configure.
// That is why "apOnly" stays true even with the uplink built in — the dashboard
// reads that flag as "no network settings to show", which is still the truth, and
// flipping it would make the old baked-in UI offer an editor backed by endpoints
// that no longer exist. "nets":[] and "max":0 are preserved for the same reason.
// The uplink* fields are additive; a dashboard that predates them ignores them.
void handleWifiControl() {
  String json = "{";
  json += "\"mode\":\"ap\",";
  json += "\"apOnly\":true,";
  json += "\"current\":\"" + String(apSsid) + "\",";
  json += "\"ip\":\"" + WiFi.softAPIP().toString() + "\",";
  json += "\"clients\":" + String(apClients()) + ",";
  json += "\"host\":\"" + String(portalHost) + "\",";
#if HAS_HOME_NETWORK
  json += "\"uplinkSsid\":" + (staUp ? "\"" + WiFi.SSID() + "\"" : String("null")) + ",";
  json += "\"uplinkConnected\":" + String(staUp ? "true" : "false") + ",";
  json += "\"uplinkIp\":" + (staUp ? "\"" + WiFi.localIP().toString() + "\"" : String("null")) + ",";
  json += "\"uplinkRssi\":" + String(staUp ? WiFi.RSSI() : 0) + ",";
  // Names only, never passwords. Answers "which networks will this build even try",
  // which is otherwise only visible by reading the source or the serial log.
  json += "\"uplinkKnown\":[";
  for (int i = 0; i < homeNetworkCount; i++) {
    if (i) json += ",";
    json += "\"" + String(homeNetworks[i].ssid) + "\"";
  }
  json += "],";
#else
  json += "\"uplinkSsid\":null,";
  json += "\"uplinkConnected\":false,";
  json += "\"uplinkIp\":null,";
  json += "\"uplinkRssi\":0,";
  json += "\"uplinkKnown\":[],";
#endif
  json += "\"max\":0,";
  json += "\"nets\":[]}";

  sendCors();
  server.send(200, "application/json", json);
}

// ===== NETWORK SERVICES =====
// mDNS + OTA start once, right after the AP is up — the AP's subnet is ours and
// fixed at 192.168.4.x, so on that interface nothing ever needs re-announcing and
// the old servicesStarted guard has nothing left to guard. The one exception is
// mDNS when an uplink appears later: serviceUplink() restarts it so the name also
// answers on the home network.
void startNetworkServices() {
  Serial.printf("AP '%s' up  IP: %s\n", apSsid, WiFi.softAPIP().toString().c_str());
  digitalWrite(PIN_LED_ERROR, LOW);

  // Clients get this address as their DNS server from the AP's own DHCP, so
  // answering everything with our own IP is all it takes.
  if (dnsServer.start(53, "*", WiFi.softAPIP())) {
    Serial.printf("DNS: catch-all -> %s  (http://%s)\n",
                  WiFi.softAPIP().toString().c_str(), portalHost);
  } else {
    Serial.println("DNS server failed — reach the dashboard at 192.168.4.1");
  }

  // DHCP option 114: hands the portal URL straight to the client, so a modern
  // phone can skip probing altogether. Belt and braces next to the redirect
  // below — older clients ignore the option, newer ones prefer it.
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 2)
  if (WiFi.AP.enableDhcpCaptivePortal()) {
    Serial.println("Captive portal: DHCP option 114 advertised");
  }
#endif

  if (MDNS.begin(hostname)) {
    MDNS.addService("http", "tcp", 80);
    Serial.printf("mDNS: http://%s.local\n", hostname);
  }

  ArduinoOTA.setHostname(hostname);
  ArduinoOTA.setPassword(otaPassword);
  // ArduinoOTA.handle() blocks for the whole upload, so server.handleClient()
  // never runs and the dashboard's polls pile up unaccepted. lwIP has only
  // 16 TCP PCBs (CONFIG_LWIP_MAX_ACTIVE_TCP) and holds closed ones in TIME_WAIT
  // for 60 s, so the pool is empty after ~8 s — then tcp_kill_prio() reaps the
  // OTA socket itself and the upload dies around 5 %. Shut port 80 for the
  // duration; a successful update reboots, a failed one restores the server.
  // The SSE subscriber is stopped too — its 20 Hz frames would compete with the
  // OTA transfer for WiFi airtime and TCP buffers (and at 20 Hz that competition
  // is five times what it used to be, so dropping it matters more, not less).
  ArduinoOTA.onStart([]() {
    sseClient.stop();
    sseFrame = "";      // nothing left half-sent to a socket that no longer exists
    sseSent  = 0;
    server.close();
    Serial.println("OTA start");
  });
  ArduinoOTA.onEnd  ([]() { Serial.println("OTA end");   });
  ArduinoOTA.onError([](ota_error_t) { server.begin(); });
  ArduinoOTA.begin();
  Serial.println("OTA ready");
}

#if HAS_HOME_NETWORK
// Uplink state machine, polled from loop(). Deliberately never blocks: WiFi.begin()
// only kicks the association off, and the result is read on a later pass. The old
// station mode's 30-second blocking wifiMulti.run() is exactly what this avoids —
// it used to freeze the dashboard and starve readSensors() for whole seconds.
//
// The AP is not touched anywhere in here. There is no path in this function that
// can take the station off the air.
//
// With several candidates it walks homeNetworks[] one entry per attempt, giving each
// STA_ASSOC_MS to answer, and only after a whole pass has failed does it wait out the
// backoff. Order is preference: the first network that happens to be in range wins,
// because the pass stops the moment a link comes up.
void serviceUplink() {
  bool now = (WiFi.status() == WL_CONNECTED);

