temafey/ArduinoWindStation/esp32_wind_station/esp32_wind_station.ino
  if (now != staUp) {
    staUp = now;
    if (now) {
      staBackoffMs = STA_RETRY_MIN_MS;   // a good link earns a fast retry next time
      staIndex = 0;                      // and the next search starts from the top
      Serial.printf("Uplink '%s' joined  IP: %s  RSSI=%d\n",
                    WiFi.SSID().c_str(), WiFi.localIP().toString().c_str(), WiFi.RSSI());
      // mDNS was started when the AP was the only interface, so its responder is
      // bound to that one and the name stays invisible from the house. Restarting
      // it now re-announces on both.
      MDNS.end();
      if (MDNS.begin(hostname)) {
        MDNS.addService("http", "tcp", 80);
        Serial.printf("mDNS: http://%s.local (also on the home network)\n", hostname);
      }
      // Joining brought the station interface up and moved the AP to the router's
      // channel — both are driver re-inits, and the radio tuning from setup() is
      // exactly the kind of setting that does not always survive one. Cheap to
      // reassert, and silently losing half the TX power here would look like
      // "the AP got weaker after a while" and be almost impossible to trace.
      WiFi.setSleep(false);
      WiFi.setTxPower(WIFI_POWER_21dBm);
    } else {
      Serial.println("Uplink lost — AP unaffected");
      staNextAttempt = millis() + staBackoffMs;
    }
  }

  if (now) return;
  // Signed comparison so the wrap of millis() at 49.7 days cannot park this forever.
  if ((long)(millis() - staNextAttempt) < 0) return;

  const HomeNetwork& candidate = homeNetworks[staIndex];
  Serial.printf("Uplink: trying '%s' (%d/%d)\n",
                candidate.ssid, staIndex + 1, homeNetworkCount);
  WiFi.begin(candidate.ssid, candidate.password);

  staIndex++;
  if (staIndex < homeNetworkCount) {
    staNextAttempt = millis() + STA_ASSOC_MS;   // next candidate, no long wait
  } else {
    // Whole list exhausted: back off before starting over, so a station on a mast
    // with none of these networks in range stops interrupting its own AP.
    staIndex = 0;
    staNextAttempt = millis() + staBackoffMs;
    if (staBackoffMs < STA_RETRY_MAX_MS) {
      staBackoffMs = min(staBackoffMs * 2, STA_RETRY_MAX_MS);
    }
  }
}
#endif

// ===== SETUP =====
void setup() {
  // Before Serial.begin — the UART divisor is derived from the CPU clock, so changing
  // the frequency afterwards would garble the console. Normally already 240 MHz from
  // the core's default sdkconfig; pinned here so a board profile that boots at 80 MHz
  // cannot quietly stretch every ADC burst and JSON build.
  setCpuFrequencyMhz(240);

  Serial.begin(115200);
  Serial.println("\n=== Wind Station ===");

  pinMode(PIN_LED_GREEN,  OUTPUT);
  pinMode(PIN_LED_YELLOW, OUTPUT);
  pinMode(PIN_LED_RED,    OUTPUT);
  pinMode(PIN_LED_WIFI,   OUTPUT);
  pinMode(PIN_LED_ERROR,  OUTPUT);

  // TP4056 status lines are open-drain and float when inactive — internal pullup required.
  pinMode(PIN_CHARGE, INPUT_PULLUP);
#if HAS_STDBY
  pinMode(PIN_STDBY,  INPUT_PULLUP);
#endif

  analogReadResolution(12);
  analogSetPinAttenuation(PIN_WIND_SPEED, ADC_11db);
  analogSetPinAttenuation(PIN_WIND_DIR,   ADC_11db);
  analogSetPinAttenuation(PIN_BATTERY,    ADC_11db);

  // The WiFi driver keeps its own copy of the last STA credentials in NVS and joins
  // that network by itself the moment station mode starts — including credentials
  // left by some earlier build, which survive every OTA update because the nvs
  // partition is never rewritten. The uplink below must be the one in this source
  // and nothing else, so bring STA up once, wipe the stored config (the second
  // argument of disconnect() is eraseap), and only then set the working mode.
  // Order matters: persistent(false) first would route the erase to RAM and leave
  // the credentials sitting in flash.
  WiFi.mode(WIFI_STA);
  WiFi.disconnect(true, true);
  WiFi.persistent(false);   // nothing this firmware does should write creds back
#if HAS_HOME_NETWORK
  WiFi.mode(WIFI_AP_STA);
#else
  WiFi.mode(WIFI_AP);
#endif
  WiFi.setHostname(hostname);       // before begin(): this is the name DHCP is told
  WiFi.softAPsetHostname(hostname);

  // WPA2-protected AP on the default 192.168.4.1/24. Channel 1, not hidden: hiding
  // an SSID stops nobody who can run a scanner and mostly annoys phones, the
  // passphrase is what actually keeps strangers out.
  apUp = WiFi.softAP(apSsid, apPassword, 1 /*channel*/, 0 /*hidden*/, apMaxClients);

  // A client in power save only listens on the DTIM beacon; until then the AP holds
  // its frames. Arduino's APClass::create() memsets the whole wifi_config_t and then
  // never assigns dtim_period, so what reaches the driver is 0 — outside the documented
  // 1..10 range and not something to rely on when the number decides how long a phone
  // waits for its data. Pinned to 1 (every beacon, ~102 ms) so a sleeping dashboard is
  // never held longer than one beacon interval. Costs the client a little battery.
  wifi_config_t apConf;
  if (esp_wifi_get_config(WIFI_IF_AP, &apConf) == ESP_OK) {
    apConf.ap.beacon_interval = 100;
    apConf.ap.dtim_period     = 1;
    esp_wifi_set_config(WIFI_IF_AP, &apConf);
  }

  // ===== LOW-LATENCY LINK =====
  // Set after softAP() — starting an interface re-inits the driver and restores the
  // defaults these two lines exist to override.
  // Default power save parks the receiver between beacons and only drains the
  // buffer on wake-up. Measured on this board with it on: ping 3 ms at best but
  // 287 ms at worst, and SSE frames landing 147-360 ms apart instead of a steady
  // 250 — the frame is ready on time, it just waits for the radio. Off means the
  // receiver runs continuously: ~30 mA idle becomes ~120 mA, which is the entire
  // price of turning 47 ms of jitter into single-digit milliseconds.
  WiFi.setSleep(false);
  // Max TX power. Throughput is not the issue here (a frame is ~330 bytes), retries
  // are: every 802.11 retransmit costs a full airtime slot and surfaces as a latency
  // spike, so buy link margin with power this station has no reason to conserve.
  //
  // Asks for the top of the enum rather than a value known to be reachable: the
  // driver clamps to whatever the PHY and the calibration data actually allow, so
  // this yields the chip's ceiling instead of a guess about it. Which is why the
  // result is read back and printed — the number in the log is measured, not assumed.
  WiFi.setTxPower(WIFI_POWER_21dBm);
  Serial.printf("TX power: %.1f dBm (asked for the maximum the radio allows)\n",
                (int)WiFi.getTxPower() / 4.0);

