temafey/ArduinoWindStation/esp32_wind_station/esp32_wind_station.ino
  if (apUp) {
    startNetworkServices();
  } else {
    // softAP() only fails if the radio itself refused to start — the station is
    // then unreachable by any route, so the error LED is the only way to say so.
    Serial.println("softAP() FAILED — no network");
    digitalWrite(PIN_LED_ERROR, HIGH);
  }

#if HAS_HOME_NETWORK
  // Kicked off last and never waited on: setup() must not spend seconds here, and
  // whether the home network answers changes nothing about the AP that is already
  // serving. serviceUplink() picks up the result on a later pass through loop().
  //
  // One radio, one channel: the AP came up on channel 1, and when the uplink
  // associates to a router on another channel the AP follows it there. Clients on
  // the AP drop and rejoin once for that — unavoidable on a single-radio part, and
  // the reason this is the last thing setup() does.
  WiFi.setAutoReconnect(false);   // serviceUplink() owns retries, see staBackoffMs
  // No WiFi.begin() here on purpose: staNextAttempt in the past makes the first pass
  // through loop() start the search, so the list is walked by one piece of code
  // instead of two that could disagree about which candidate is next.
  staNextAttempt = millis();
  Serial.printf("Uplink: %d network(s) to try in the background (2.4 GHz only)\n",
                homeNetworkCount);
#endif

  server.on("/api/data",   HTTP_GET, handleData);
  server.on("/api/stream", HTTP_GET, handleStream);
  server.on("/api/led",    HTTP_GET, handleLedControl);
  server.on("/api/gust",   HTTP_GET, handleResetGust);
  server.on("/api/zero",   HTTP_GET, handleZero);
  server.on("/api/wifi",   HTTP_GET, handleWifiControl);
  // Embedded dashboard: "/" is index.html, the rest are its hashed assets.
  for (size_t i = 0; i < WEB_ASSET_COUNT; i++) {
    const WebAsset* a = &WEB_ASSETS[i];
    server.on(a->path, HTTP_GET, [a]() {
      server.sendHeader("Content-Encoding", "gzip");
      server.sendHeader("Cache-Control", a->cacheControl);
      server.send_P(200, a->mime, (const char*)a->data, a->len);
    });
  }
  // Anything not registered above is a captive-portal probe: the OS asks for a
  // known URL and judges the network by the answer. A 302 elsewhere is the
  // universal "you are behind a portal" signal — Android expects 204 from
  // /generate_204, Apple expects a page containing Success, Windows expects
  // its connecttest.txt — so redirecting satisfies none of them on purpose, and
  // each platform then offers to open the target. That target is the dashboard.
  //
  // Sending the name rather than 192.168.4.1: to have reached this handler the
  // client must have resolved something through our own DNS, so the name is
  // guaranteed to resolve for it too — and it is the address worth showing.
  server.onNotFound([]() {
    server.sendHeader("Location", String("http://") + portalHost + "/", true);
    server.send(302, "text/plain", "");
  });

  server.begin();
  Serial.println("HTTP: 80");
}

// ===== MAIN LOOP =====
unsigned long lastRead    = 0;
unsigned long lastSse     = 0;
unsigned long lastLog     = 0;
unsigned long lastBattery = 0;
unsigned long lastCharge  = 0;
unsigned long lastLed     = 0;
unsigned long lastRssi    = 0;
// Longest single pass through loop() since the last Serial line. Everything here is
// cooperative, so one slow call delays every other subsystem — this is what makes that
// visible instead of leaving it to be guessed from symptoms.
unsigned long loopMaxMs   = 0;

void loop() {
  unsigned long loopStart = millis();

  ArduinoOTA.handle();
  server.handleClient();

  if (millis() - lastRead > READ_INTERVAL_MS) {
    readSensors();
    lastRead = millis();
  }

  // Queue a frame for the SSE subscriber (if any); drop the slot once it disconnects.
  // Only one frame is ever outstanding: if the previous one has not finished leaving,
  // this tick is skipped rather than queued behind it, so the link never accumulates a
  // backlog of samples the dashboard would render late.
  if (millis() - lastSse > SSE_PUSH_MS) {
    if (sseClient.connected()) {
      if (sseSent >= sseFrame.length()) {
        sseFrame = "data: " + buildDataJson() + "\n\n";
        sseSent  = 0;
      } else {
        sseDropped++;
      }
    } else {
      sseClient.stop();
      sseFrame = "";
      sseSent  = 0;
    }
    lastSse = millis();
  }

  // Every pass, not every push: a frame the socket could only take half of drains as
  // soon as the window reopens instead of waiting out the next 50 ms tick.
  sseFlush();

  // Serial log stays slow — 250 ms would flood the console.
  if (millis() - lastLog > 2000) {
    lastLog = millis();
    // loopMax and sse are the two numbers that tell a laggy dashboard from a laggy
    // sensor: loopMax is the longest single pass since the last line (anything past a
    // few ms means something in loop() is blocking and readSensors() is being starved),
    // sse counts frames skipped because the subscriber could not take them in time.
    // "±N" is the spread of the last sample burst. It is printed next to the raw mV on
    // purpose: those two together say whether a wrong reading is a wrong zero point
    // (mV off, spread small) or interference (mV jumping, spread large).
    Serial.printf("V=%.1f m/s (%.0f mV ±%.0f, zero %.0f)  D=%.0f°  G=%.1f  "
                  "Bat=%.2fV (%d%%) %s/%s  RSSI=%d  loopMax=%lums  sseDrop=%lu\n",
                  windSpeed, speedMvRaw, speedMvSpread, speedZeroMv, windDir, windGust,
                  batteryVoltage, batteryPercent, powerSource, chargeState, wifiRssi,
                  loopMaxMs, sseDropped);
    loopMaxMs  = 0;
    sseDropped = 0;
  }

  // LED status updates independently so LED_WIFI follows the client count without
  // waiting on the 2-second Serial tick.
  if (millis() - lastLed > 500) {
    updateLEDs();
    lastLed = millis();
  }

  if (millis() - lastRssi > 5000) {
    wifiRssi = readClientRssi();
    lastRssi = millis();
  }

  if (millis() - lastBattery > 30000) {
    readBattery();
    lastBattery = millis();
  }

  // Fast poll: the charger blinks at ~1 Hz when it has no pack to work with.
  if (millis() - lastCharge > 100) {
    readChargeStatus();
    lastCharge = millis();
  }

  if (millis() - gustResetTimer > 600000) {
    windGust = windSpeed;
    gustResetTimer = millis();
  }

  // The AP itself has nothing to service — it has no uplink that can drop, so the
  // manual switch, the 3-minute fallback AP and the 30 s blocking wifiMulti.run()
  // that used to sit here are gone for good. What is left is the optional uplink,
  // and it is a different thing entirely: no rescan, no blocking call, and no
  // authority over the AP. Unthrottled because a pass costs one cached status read;
  // the expensive part, WiFi.begin(), is behind staNextAttempt.
#if HAS_HOME_NETWORK
  serviceUplink();
#endif

  unsigned long elapsed = millis() - loopStart;
  if (elapsed > loopMaxMs) loopMaxMs = elapsed;
}
